-- Кончик стрелки (X, Y, Z): (614768.0573266544, 116595.8370724776, 0.0)
-- Кончик стрелки (X, Y, Z): (637908.0668742465, 116573.3804283246, 0.0)
-- Кончик стрелки (X, Y, Z): (637908.0668742465, 116573.3804283246, 0.0)
-- Кончик стрелки (X, Y, Z): (637908.0668742465, 116573.3804283246, 0.0)
-- Кончик стрелки (X, Y, Z): (637939.7730285549, 109223.4538817456, 0.0)

SELECT 
    b.id,
    b.entity_type,
    b.name,
    b.description,
    ST_AsText(b.geom),
    ST_Distance(geom, ST_Point(637939.7730285549, 109223.4538817456)) as distance
FROM 
    entity AS b
ORDER BY 
    b.geom <-> ST_Point(637939.7730285549, 109223.4538817456)
LIMIT 10;